import { DownOutlined } from "@ant-design/icons";
import { useEffect, useRef } from "react";

const stepOpen = {
  marginTop: 10,
  minHeight: 30,
  height: 300,
  transition: "all .2s ease-in",
  //overflow: "hidden",
  backgroundColor: "#000",
  color: "#fff",
  padding: 10,
  overflowY: "auto",
  whiteSpace: "pre-line"
};
const stepNotOpen = {
  height: 0,
  minHeight: 0,
  transition: "all .2s ease-in",
  overflow: "hidden",
  backgroundColor: "#f9f9f9",
};

// 状态渲染规则

  const renderStatus = {
    0: <span style={{color:"rgb(248,198,42)"}}>等待安装</span>,
    1: "安装中",
    2:  <span style={{color:"rgb(118,204,104)"}}>安装成功</span>,
    3:  <span style={{color:"#da4e48"}}>安装失败</span>,
  };

const InstallDetail = ({ title, ip, status, openName, setOpenName,log }) => {
  // const [log, setLog] = useState(
  //   `2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n
  //   2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n
  //   2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n
  //   2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n
  //   2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n
  //   2021-11-02 22:12:05 redis-7-194 开始发送服务包\n2021-11-02 22:12:06 redis-7-194 成功发送服务包\n2021-11-02 22:12:07 redis-7-194 开始解压服务包\n2021-11-02 22:12:07 redis-7-194 成功解压服务包\n2021-11-02 22:12:08 redis-7-194 开始安装服务\n2021-11-02 22:12:09 安装脚本执行成功，脚本输出如下:\n开始检查目录\n开始创建用户,修改目录权限\n开始更新文件占位符\n开始声明环境变量\n2021-11-02 22:12:09 redis-7-194 成功安装服务\n2021-11-02 22:12:12 启动脚本执行成功，脚本输出如下:\nredis  [running]\n2021-11-02 22:12:10 redis-7-194 开始初始化服务\n2021-11-02 22:12:10 redis-7-194 无需执行初始化\n2021-11-02 22:12:10 redis-7-194 开始启动服务\n2021-11-02 22:12:13 redis-7-194 成功启动服务\n`
  // );


  const containerRef = useRef(null)

  useEffect(()=>{
    containerRef.current.scrollTop =
    containerRef.current.scrollHeight;
  },[log])

  return (
    <div
      style={{
        padding: 10,
      }}
    >
      <div
        style={{
          display: "flex",
          justifyContent: "space-between",
        }}
      >
        <div style={{ flex: 1 }}>{ip}</div>
        <div style={{ flex: 1, color: "#2e7cee" }}>{renderStatus[status]}</div>
        <div style={{ flex: 6, textAlign: "right", paddingRight: 50 }}>
          <a
            onClick={() => {
              if (openName == `${title}=${ip}`) {
                setOpenName("");
              } else {
                setOpenName(`${title}=${ip}`);
              }
            }}
          >
            查看详细安装信息
            <DownOutlined
              style={{
                transform: `rotate(${
                  openName == `${title}=${ip}` ? 180 : 0
                }deg)`,
                position: "relative",
                top: openName == `${title}=${ip}` ? -1 : 1,
                left: 3,
              }}
            />
          </a>
        </div>
      </div>
      <div ref={containerRef} style={openName == `${title}=${ip}` ? stepOpen : stepNotOpen}>
        {log || "暂无数据"}
      </div>
    </div>
  );
};

export default InstallDetail;
